(function(){
  var data = [{
    "id":"1",
    "name":"颈椎区直",
    "methods":[
      "1.注意坐姿。不要长时间低着头。长时间低着头是颈椎区直的源头，想要治疗颈椎区直必须先堵住源头。推荐办公时坐、站交替。",
      "2.多活动脖子。有事没事头左转转右扭扭前点点后仰仰，尽量保持每隔45分钟动动脖子。注意轻柔，不要过猛。",
      "3.可以买相关枕头枕。网上的各种颈椎康复枕可以试试。",
      "4.注意作息。争取每天10:30之前进入睡眠状态。周末可以打打羽毛球。",
      "5.加强运动。争取每周四天，每天超过6000步的运动量。",
      "6.尽量少低头看手机。",
      "以上几项综合坚持2-3个月"
    ]
  },{
    "id" : "2",
    "name" : "干眼症",
    "methods" : [
      "1.注意适度用眼。不要长时间盯着电脑，每隔45分钟，四处瞅瞅。",
      "2.买点眼药水疼痛的时候滴点。"
    ]
  }];

  var menu = { 
    url : window.urlPrefix+"api/list.json",
    data : {
      code : 0,
      data : data
    }
  }

  Mock.mock(new RegExp(menu.url+".*"),function(result){
    return menu.data;
  });
})(Mock);